In [1]:
import pandas as pd

In [2]:
s = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd'])

In [3]:
print(s)

a    3
b   -5
c    7
d    4
dtype: int64

In [4]:
data = {'Country':['Belgium', 'India', 'Brazil'], 'Capital': ['Brusells', 'New Delhi', 'Brasilia'], 'Population':[1.1, 1.3, 2.0]}

In [14]:
data_frame = pd.DataFrame(data, columns = ['Country', 'Capital', 'Population'])

In [15]:
print(data_frame)

   Country    Capital  Population
0  Belgium   Brusells         1.1
1    India  New Delhi         1.3
2   Brazil   Brasilia         2.0

In [17]:
data_frame.to_csv('data_frame_2.csv')

In [18]:
data_frame[1:]

  Country    Capital  Population
1   India  New Delhi         1.3
2  Brazil   Brasilia         2.0

In [23]:
data_frame[data_frame['Population']==2.0]

  Country   Capital  Population
2  Brazil  Brasilia         2.0

In [25]:
data_frame.sort_values(by='Country')

   Country    Capital  Population
0  Belgium   Brusells         1.1
2   Brazil   Brasilia         2.0
1    India  New Delhi         1.3

In [26]:
data_frame.sort_values(by='Population')

   Country    Capital  Population
0  Belgium   Brusells         1.1
1    India  New Delhi         1.3
2   Brazil   Brasilia         2.0

In [29]:
data_frame.sum()

Country              BelgiumIndiaBrazil
Capital       BrusellsNew DelhiBrasilia
Population                          4.4
dtype: object

In [30]:
data_frame.describe()

       Population
count    3.000000
mean     1.466667
std      0.472582
min      1.100000
25%      1.200000
50%      1.300000
75%      1.650000
max      2.000000

In [31]:
f = lambda x: x*2

In [34]:
data_frame.applymap(f)

          Country             Capital  Population
0  BelgiumBelgium    BrusellsBrusells         2.2
1      IndiaIndia  New DelhiNew Delhi         2.6
2    BrazilBrazil    BrasiliaBrasilia         4.0

In [42]:
data_frame.reindex(range(4), method='ffill')

   Country    Capital  Population
0  Belgium   Brusells         1.1
1    India  New Delhi         1.3
2   Brazil   Brasilia         2.0
3   Brazil   Brasilia         2.0

In [47]:
data_frame.duplicated()

0    False
1    False
2    False
dtype: bool

In [48]:
data_frame_2 = data_frame[:]

In [49]:
data_frame_2

   Country    Capital  Population
0  Belgium   Brusells         1.1
1    India  New Delhi         1.3
2   Brazil   Brasilia         2.0

In [52]:
pd.merge(data_frame, data_frame_2, how = 'right', on = 'Population')

  Country_x  Capital_x  Population Country_y  Capital_y
0   Belgium   Brusells         1.1   Belgium   Brusells
1     India  New Delhi         1.3     India  New Delhi
2    Brazil   Brasilia         2.0    Brazil   Brasilia